app/Controllers/AppController.php

    public function home(){
        $judul_foto =  $this->request->getVar("judul_foto");
        if ($judul_foto == null) {
            $rows = $this->foto
            ->orderBy("judul_foto","asc")
            ->FindAll();
        }
        else{
            $rows = $this->foto
                ->orderBy("judul_foto","asc")
                ->like("judul_foto",$judul_foto)
                ->FindAll();
        }
        $rows1 = $this->album
                ->orderBy("album_id","asc")
                ->FindAll();
---
SELECT *
FROM `foto`
ORDER BY `judul_foto` ASC
SELECT *
FROM `album`
ORDER BY `album_id` ASC

    public function profil(){
        $username = $this->user
            ->where("user_id", session()->get("user_id"))
            ->first();
---
SELECT *
FROM `user`
WHERE `user_id` = '4'
 LIMIT 1

    public function preview($foto_id)
    {
        $userId = session()->user_id;
        // Ambil data foto berdasarkan foto_id
        $foto = $this->foto
            ->join("user", "user.user_id = foto.user_id", "left")
            ->where("foto_id", $foto_id)
            ->first();

        // Ambil data komentar berdasarkan foto_id
        $komentars = $this->komentar
                         ->where("foto_id",$foto_id)
                         ->findall();

        $rows1  = $this->album
                        ->where("album_id",$foto_id)
                        ->findall();
---
SELECT *
FROM `foto`
LEFT JOIN `user` ON `user`.`user_id` = `foto`.`user_id`
WHERE `foto_id` = '62'
 LIMIT 1
SELECT *
FROM `album`
WHERE `album_id` = '62'